-- phpMyAdmin SQL Dump
-- version 5.0.2
-- https://www.phpmyadmin.net/
--
-- 主机： 10.10.0.1
-- 生成日期： 2023-11-28 02:26:02
-- 服务器版本： 10.3.23-MariaDB-0+deb10u1
-- PHP 版本： 7.3.19-1~deb10u1

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 数据库： `chirou_hz_cz`
--

-- --------------------------------------------------------

--
-- 表的结构 `rou`
--

CREATE TABLE `rou` (
  `id` int(11) NOT NULL,
  `tiezi` varchar(255) NOT NULL,
  `time` timestamp NOT NULL DEFAULT current_timestamp(),
  `zhuangtai` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 转存表中的数据 `rou`
--

INSERT INTO `rou` (`id`, `tiezi`, `time`, `zhuangtai`) VALUES
(1, '1252946', '2023-11-25 10:40:36', 1),
(2, '1252945', '2023-11-25 10:45:07', 1),
(3, '1252941', '2023-11-25 10:45:07', 1),
(4, '1252940', '2023-11-25 10:45:07', 1),
(5, '1253213', '2023-11-26 12:26:04', 1),
(6, '1253205', '2023-11-26 12:26:04', 1),
(7, '1253223', '2023-11-26 13:14:03', 1),
(8, '1253239', '2023-11-26 14:16:19', 1),
(9, '1253246', '2023-11-26 14:42:04', 1),
(10, '1253256', '2023-11-26 15:44:03', 1),
(11, '1253264', '2023-11-26 16:48:03', 1),
(12, '1253287', '2023-11-27 00:15:14', 1),
(13, '1253295', '2023-11-27 00:52:02', 1),
(14, '1253297', '2023-11-27 01:00:05', 1),
(15, '1253299', '2023-11-27 01:04:03', 1),
(16, '1253312', '2023-11-27 02:00:13', 1),
(17, '1253359', '2023-11-27 04:33:41', 1),
(18, '1253362', '2023-11-27 04:36:04', 1),
(19, '1253361', '2023-11-27 04:36:04', 1),
(20, '1253367', '2023-11-27 05:00:05', 1),
(21, '1253368', '2023-11-27 05:06:06', 1),
(22, '1253415', '2023-11-27 08:31:12', 1),
(23, '1253431', '2023-11-27 09:22:06', 1),
(24, '1253448', '2023-11-27 10:37:45', 1),
(25, '1253478', '2023-11-27 12:10:40', 1),
(26, '1253479', '2023-11-27 12:22:08', 1),
(27, '1253549', '2023-11-27 16:54:39', 1),
(28, '1253559', '2023-11-27 23:18:07', 1),
(29, '1253571', '2023-11-28 00:10:04', 1),
(30, '1253582', '2023-11-28 00:52:03', 1);

-- --------------------------------------------------------

--
-- 表的结构 `task`
--

CREATE TABLE `task` (
  `id` int(11) NOT NULL,
  `sid` varchar(255) NOT NULL,
  `tiezi` varchar(255) NOT NULL,
  `result` text DEFAULT NULL,
  `request_time` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 转存表中的数据 `task`
--

INSERT INTO `task` (`id`, `sid`, `tiezi`, `result`, `request_time`) VALUES
(1, '123-2', '1253415', NULL, '2023-11-27 08:32:01'),
(2, '456-2-0-0-0-0', '1253415', NULL, '2023-11-27 08:32:02'),
(3, '789-2-0-0-0-0', '1253415', NULL, '2023-11-27 08:32:03'),
(4, '147-2', '1253415', NULL, '2023-11-27 08:32:04'),
(5, '258-2', '1253415', NULL, '2023-11-27 08:32:04'),
(6, '123-2', '1253431', NULL, '2023-11-27 09:24:01'),
(7, '456-2-0-0-0-0', '1253431', NULL, '2023-11-27 09:24:02'),
(8, '789-2-0-0-0-0', '1253431', NULL, '2023-11-27 09:24:03'),
(9, '147-2', '1253431', NULL, '2023-11-27 09:24:05'),
(10, '258-2', '1253431', NULL, '2023-11-27 09:24:05'),
(11, '123-2', '1253448', NULL, '2023-11-27 10:38:01'),
(12, '456-2-0-0-0-0', '1253448', NULL, '2023-11-27 10:38:03'),
(13, '789-2-0-0-0-0', '1253448', '<div class=\"tip\">回复成功！获得妖晶:230，获得经验:10 </div>', '2023-11-27 10:38:04'),
(14, '147-2', '1253448', '<div class=\"tip\">回复成功！获得妖晶:230，获得经验:10 </div>', '2023-11-27 10:38:05'),
(15, '258-2', '1253448', '<div class=\"tip\">回复成功！获得妖晶:230，获得经验:10 </div>', '2023-11-27 10:38:07'),
(16, '123-2', '1253478', NULL, '2023-11-27 12:12:01'),
(17, '456-2-0-0-0-0', '1253478', NULL, '2023-11-27 12:12:03'),
(18, '789-2-0-0-0-0', '1253478', '<div class=\"tip\">回复成功！获得妖晶:230，获得经验:10 </div>', '2023-11-27 12:12:05'),
(19, '147-2', '1253478', '<div class=\"tip\">回复成功！获得妖晶:230，获得经验:10 </div>', '2023-11-27 12:12:06'),
(20, '258-2', '1253478', '<div class=\"tip\">回复成功！获得妖晶:230，获得经验:10 </div>', '2023-11-27 12:12:07'),
(21, '123-2', '1253479', NULL, '2023-11-27 12:24:01'),
(22, '456-2-0-0-0-0', '1253479', NULL, '2023-11-27 12:24:03'),
(23, '789-2-0-0-0-0', '1253479', '<div class=\"tip\">回复成功！获得妖晶:230，获得经验:10 </div>', '2023-11-27 12:24:05'),
(24, '147-2', '1253479', '<div class=\"tip\">回复成功！获得妖晶:230，获得经验:10 </div>', '2023-11-27 12:24:06'),
(25, '258-2', '1253479', '<div class=\"tip\">回复成功！获得妖晶:230，获得经验:10 </div>', '2023-11-27 12:24:07'),
(26, '123-2', '1253549', NULL, '2023-11-27 16:56:01'),
(27, '456-2-0-0-0-0', '1253549', NULL, '2023-11-27 16:56:02'),
(28, '789-2-0-0-0-0', '1253549', '<div class=\"tip\">回复成功！获得妖晶:230，获得经验:10 </div>', '2023-11-27 16:56:04'),
(29, '147-2', '1253549', '<div class=\"tip\">回复成功！获得妖晶:230，获得经验:10 </div>', '2023-11-27 16:56:05'),
(30, '258-2', '1253549', '<div class=\"tip\">回复成功！获得妖晶:230，获得经验:10 </div>', '2023-11-27 16:56:06'),
(31, '123-2', '1253559', NULL, '2023-11-27 23:20:01'),
(32, '456-2-0-0-0-0', '1253559', NULL, '2023-11-27 23:20:08'),
(33, '789-2-0-0-0-0', '1253559', '<div class=\"tip\">回复成功！获得妖晶:230，获得经验:10 </div>', '2023-11-27 23:20:10'),
(34, '147-2', '1253559', '<div class=\"tip\">回复成功！获得妖晶:230，获得经验:10 </div>', '2023-11-27 23:20:10'),
(35, '258-2', '1253559', '<div class=\"tip\">回复成功！获得妖晶:230，获得经验:10 </div>', '2023-11-27 23:20:11'),
(36, '123-2', '1253571', NULL, '2023-11-28 00:12:02'),
(37, '456-2-0-0-0-0', '1253571', NULL, '2023-11-28 00:12:03'),
(38, '789-2-0-0-0-0', '1253571', NULL, '2023-11-28 00:12:04'),
(39, '147-2', '1253571', NULL, '2023-11-28 00:12:05'),
(40, '258-2', '1253571', NULL, '2023-11-28 00:12:06'),
(41, '123-2', '1253582', NULL, '2023-11-28 00:54:01'),
(42, '456-2-0-0-0-0', '1253582', NULL, '2023-11-28 00:54:03'),
(43, '789-2-0-0-0-0', '1253582', '<div class=\"tip\">回复成功！获得妖晶:30，获得经验:10 </div>', '2023-11-28 00:54:05'),
(44, '147-2', '1253582', '<div class=\"tip\">回复成功！获得妖晶:30，获得经验:10 </div>', '2023-11-28 00:54:07'),
(45, '258-2', '1253582', '<div class=\"tip\">回复成功！获得妖晶:30，获得经验:10 </div>', '2023-11-28 00:54:08');

-- --------------------------------------------------------

--
-- 表的结构 `yh_sid`
--

CREATE TABLE `yh_sid` (
  `id` int(11) NOT NULL,
  `sid` varchar(255) NOT NULL,
  `time` timestamp NOT NULL DEFAULT current_timestamp(),
  `userid` int(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 转存表中的数据 `yh_sid`
--

INSERT INTO `yh_sid` (`id`, `sid`, `time`, `userid`) VALUES
(18, '123-2', '2023-11-27 04:50:25', 0);

--
-- 转储表的索引
--

--
-- 表的索引 `rou`
--
ALTER TABLE `rou`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `task`
--
ALTER TABLE `task`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `yh_sid`
--
ALTER TABLE `yh_sid`
  ADD PRIMARY KEY (`id`);

--
-- 在导出的表使用AUTO_INCREMENT
--

--
-- 使用表AUTO_INCREMENT `rou`
--
ALTER TABLE `rou`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=31;

--
-- 使用表AUTO_INCREMENT `task`
--
ALTER TABLE `task`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=46;

--
-- 使用表AUTO_INCREMENT `yh_sid`
--
ALTER TABLE `yh_sid`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=19;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
